PascalAI2024/JarvisNano/boards/waveshare/esp32s3_touch_amoled_1_75/sdkconfig.defaults.board
# Original Waveshare ESP32-S3-Touch-AMOLED-1.75 compatibility reference.
# Not consumed by the supported release build. ESP32-S3R8: 16 MB flash,
# 8 MB octal PSRAM.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Historical CO5300-safe flash geometry: 16 MB DIO @ 80 MHz.
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 8 MB octal PSRAM @ 80 MHz
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# USB: native USB-Serial/JTAG console for monitor/log over the same cable used to flash.
# Without this the board enumerates as JTAG-only and there is no /dev/cu.usbmodem* after flash —
# you would have to hold BOOT + replug for every reflash. Confirmed: factory firmware ships
# without this enabled, which is why the new unit only enumerates in download mode.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Board-manager peripheral support flags for buses it owns. The CO5300/SPI2
# display is deliberately direct-owned by jarvis_board, so display/SPI manager
# symbols must remain unset or the manager will claim a bus it must not own.
CONFIG_ESP_BOARD_PERIPH_I2C_SUPPORT=y
CONFIG_ESP_BOARD_PERIPH_GPIO_SUPPORT=y

# Audio: I2S0 duplex driving ES8311 codec (out) + ES7210 ADC (in). The ES7210
# digitizes a hardware echo-reference on MIC3; AEC itself is software (esp-sr).
CONFIG_ESP_BOARD_PERIPH_I2S_SUPPORT=y

# Touch screen (CST9217 has known broken READ_ID register; skip the probe).
# Matches the pattern esp_vocat uses for CST816S.
